{
	"project":[{
		"id":"1",
		"name":"Inventory",
		"readme":[{
			"body":"This project has been created in the purpose of giving easy access to database functionality.<br/><br/>The layout of this application is meant to be simple and easy to follow, even without documentation - which I will have a lot of.<br/><br/>The project started as a hard-coded printer database for my office, but quickly grew into an office-wide inventory system that could house any type of information.<br/>After setting up the back-end PHP and the HTML/JS structure I started seeing many places that could easily cater to any `category` that would be passed down the stream.<br/>Right now, since things have been hard-coded, you'll find many switch statements, and this is where development is currently being focused, that are progressively more functionalized - this is from testing things as I go down the line.<br/>In short: The last case in each switch statement is the most dynamic, though still incomplete.<br/>The current version is 2.0, version 1 was hard-coded for printers only. This version is still hard-coded, but with a little more room to work with and with all of the databases *we* need.<br/>Having said that: I plan on the finished project being totally polished and streamlined by v3.<br/><br/>There is a TODO outlining the kind-of-sort-of plans I have, and it's finally starting to take shape.<br/>I'm very excited about the implications of this project: giving non-technical users the ability to access databases and robust functionality in a simple, maintainable, a reliable point-and-click fashion.<br/><br/>Things have been scattered out everywhere, but this I'm this documentation is an attempt at taming the beast.<br/>Once this version is put into production notes will be made and changes can be added accordingly.<br/><br/>There is a list of bugs, though it's pretty lackluster.<br/>The only killer bug is that if there are empty databases, javascript doesn't know how to respond. Kind of an oversight since I never did have empty databases during the development of v2, just a heads-up and can (and might already) be fixed.<br/><br/>I intend on version 3 having some legit features including: users with settings and restrictions, customized categories, export/import/convert SQL/XML/JSON, Email alerts for certain variable values, stand-alone package for offline mode - Qt wrapper with JSON/XML database. I had thoughts about Active Directory integration, but Directory Wizzards (https://www.dirwiz.com/profiler/) seem to have that one figured out, so it's not pressing.<br/>",
			"edited":"04-22-14",
			"date":"08-13-13",
			"author":"Jordan"
		}],
		"todo":[{
			"id":"1",
			"headline":"Values are still sticky when selecting Add.",
			"date":"04-22-14",
			"notes":[{
				"body":"To change this, divs only need to be declared hidden when the view switches.",
				"date":"05-22-14"
			}],
			"priority_index":[{
				"type":"bug",
				"workload":"light",
				"importance":"minimal",
				"due_date":"none"
			}]
		}]
	}]
}
